#include <iostream>
#include <vector>
#include <algorithm>
using namespace std;

// 已知一群老鼠的体重和速度，从中选取一个尽可能大的子集，
// 子集中的老鼠，体重增加，速度下降！
/*
{8000,14},
{6300,12},
{6200,20},
{6100,21},
{6000,13},
{2000,19}
{1100,30},
{1000,40},
{500, 20},
*/ 

struct Mouse
{
	int w; // 体重
	int s; // 速度
};


void main()
{
	Mouse ms[]={{6000,13},{6100,21},{500, 20},
			    {1000,40},{1100,30},{6200,20},
			    {8000,14},{6300,12},{2000,19}
	};  
	int n=9;
	// 得到重量升序的排列
	sort(ms,ms+9);
	// 在其中查找“速度递减子序列”
	int k=GetLIS(ms, n);
	cout<<k<<endl;
}


